In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['Vaibhav', 'Aakash', 'Rohan', 'Mohan'],
    "city":[100, 99, 95, 90],
    "roll_num":[21, 22, 19, 20],
    "title":['Godlike Great Emperor', 'Civil Warrior', 'Sara din confused', 'bechara, koi title nahi hai'],
}

In [6]:
df = pd.DataFrame(dict1) # Dataframe in pandas used to create a table.

In [4]:
df

      name  city  roll_num                        title
0  Vaibhav   100        21        Godlike Great Emperor
1   Aakash    99        22                Civil Warrior
2    Rohan    95        19            Sara din confused
3    Mohan    90        20  bechara, koi title nahi hai

In [8]:
df.to_csv('random_file.csv') 
# conversion of above data into excel sheet using 'to_csv' and pass file name in () as random_file.csv
# df.to_csv('random_file.csv', index= False) ab yeh jo starting m numbering aa rahe the veh htt jie g

In [9]:
df.head(1) # head() use kro upr k data dekhne k lie
# as data avi km hai but in reality data thousands of rows hote hai so use head() abd pass how many row i want to see as i pass
# above 1 to see first row

      name  city  roll_num                  title
0  Vaibhav   100        21  Godlike Great Emperor

In [10]:
df.tail(1)  # tail() use kro last k data dekhne k lie
# as data avi km hai but in reality data thousands of rows hote hai so use tail() abd pass how many row i want to see as i pass
# above 1 to see last row

    name  city  roll_num                        title
3  Mohan    90        20  bechara, koi title nahi hai

In [12]:
df.describe() # yeh jo hai mere numerical values k count,mean,std,min,max etc ko calculate krta hai.

             city   roll_num
count    4.000000   4.000000
mean    96.000000  20.500000
std      4.546061   1.290994
min     90.000000  19.000000
25%     93.750000  19.750000
50%     97.000000  20.500000
75%     99.250000  21.250000
max    100.000000  22.000000

In [15]:
read_file = pd.read_csv('random_file.csv') # use to read a csv file

In [16]:
read_file

   Unnamed: 0     name  city  roll_num                        title
0           0  Vaibhav   100        21        Godlike Great Emperor
1           1   Aakash    99        22                Civil Warrior
2           2    Rohan    95        19            Sara din confused
3           3    Mohan    90        20  bechara, koi title nahi hai

In [18]:
read_file['title'][3]

'bechara, koi title nahi hai'

In [19]:
# now update the existing data. Although it's not good way but it is working
read_file['title'][3] = 'Title wala'

C:\Users\Ashish vats\AppData\Local\Temp\ipykernel_40968\2399698154.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  read_file['title'][3] = 'Title wala'
C:\Users\Ashish vats\AppData\Local\Temp\ipykernel_40968\2399698154.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  read_file['title'][3] = 'Title wala'

In [20]:
read_file

   Unnamed: 0     name  city  roll_num                  title
0           0  Vaibhav   100        21  Godlike Great Emperor
1           1   Aakash    99        22          Civil Warrior
2           2    Rohan    95        19      Sara din confused
3           3    Mohan    90        20             Title wala